spec/dummy/app/controllers/dummy_resources_controller.rb

  def index
    @dummy_resources = DummyResource.all
---
SELECT "dummy_resources".* FROM "dummy_resources"